package 梅花易数易学.自然属性;

/**
 * Created by zyf on 2016/9/11.
 */
public enum 万物类属 {
    乾("天、父、老人、官贵、头、骨、马、金宝、珠玉、水果、圆物、冠、镜、刚物、、大赤色、水寒"),
    兑("泽、少女、巫、舌、妾、肺、羊、毁折之物、带口之器、属金者、废缺之物、奴仆、婢"),
    离("火、雉、日、目、电、霓霞、中女、甲胄、戈兵、文书、槁木、炉、、兽、鳄龟蟹蚌、凡有壳之物、红赤紫色、花纹人、干燥物"),
    震("雷、长男、足、发、龙、百虫、蹄、竹、崔苇、马鸣、馵（zhu四声）足，的颡、稼、乐器之类、草木、青碧之色、树、木核、柴、蛇"),
    巽("风、少女、僧尼、鸡、股、百禽、百草、臼、香气、臭、绳、眼、羽毛、帆、扇子、枝叶之类、仙道工匠、直物、工巧之器"),
    坎("水、雨、雪、工、豚、中男、沟渎、弓轮、耳、血、月、盗、宫律、栋、从棘、狐、蒺藜、桎梏、水族、鱼、盐、酒、有核之物、黑色"),
    艮("山、土、少男、童子、狗、手指、径路、门阙、果、蓏、阍寺、鼠、虎、狐、木生之物、藤生之物、爪、鼻、黄色"),
    坤("地、母、老妇、土、牛、金、布帛、文章、舆撵、方物、柄、黄色、瓦器、腹、裳、黑色、书、米、谷");
    private String context;
    public String getString(){
        return this.context;
    }

    private 万物类属(String context) {
        this.context = context;
    }
}
